#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>


//一: 操作符分类：
//1.算术操作符
//2.移位操作符
//3.位操作符
//4.赋值操作符
//5.单目操作符
//6.关系操作符
//7.逻辑操作符
//8.条件操作符
//9.逗号表达式
//10.下标引用、函数调用和结构成员

//(1) 算术操作符
//   +   -   *   /   %
//除了 % 操作符之外，其他的几个操作符可以作用于整数和浮点数。
//int main()
//{
//	//int a = 6 / 5.0;(error)
//	//float a = 6 / 5;(error)
//	float a = 6.0f / 5.0f;
//	printf("%f\n", a);
//	return 0;
//}
//int main()
//{
//	int a = 7 % 3;
//	// % 操作符的两个操作数必须为整数，返回的是整除之后的余数
//	printf("%d\n", a);
//	return 0;
//}

//(2) 移位操作符
// << 左移操作符:左边丢弃,右边补0
// >> 右移操作符:右边丢弃;"逻辑右移":左边补0; "算术右移":左边补原符号位;
// 警告⚠:对于移位运算符，不要移动负数位，这个是标准未定义的。
//int main()
//{
//	int a = 10;
//	//把a的二进制位向左移动一位
//	//int b = a << 1;
//	int b = a >> 1;
//  //a没有改变
//	printf("b = %d\n", b);
//	return 0;
//}
//int main()
//{   //负数在内存中存放的是二进制的"补码"
//	int a = -1;                //整数的二进制表现形式:有三种(针对负数)
//	int b = a >> 1;            //原码:直接根据数值写出的二进制序列就是原码
//	//此时是算术右移           //反码:原码的符号位不变，其他位按位取反就是反码
//	printf("b = %d\n", b);     //补码:反码+1，就是补码
//	return 0;                  //(对于正整数:原码,补码,反码相同)
//}//-1
//原码:10000000000000000000000000000001
//反码:11111111111111111111111111111110
//补码:11111111111111111111111111111111

//(3) 位操作符
// & - 按(二进制)位与
// | - 按(二进制)位或
// ^ - 按(二进制)位异或:相同为0，相异为1
//注：他们的操作数必须是整数。
//int main()
//{
//	int a = 3;    //011
//	int b = 5;    //101
//	//int c = a & b;//001
//	//int c = a | b;//111
//	//int c = a ^ b;//110
//	printf("c = %d\n", c);
//	return 0;
//}
//int main()
//{
//	int a = 3;    //011
//	int b = 5;    //101
//	printf("a = %d b = %d\n", a, b);
//	//不能创建临时变量（第三个变量）,实现两个数的交换
//	//数值太大，会溢出
//	//a = a + b;
//	//b = a - b;
//	//a = a - b;
//	a = a ^ b;//110
//	b = a ^ b;//011
//	a = a ^ b;//101
//	printf("a = %d b = %d\n", a, b);
//	return 0;
//}
// 应用
//int main()
//{
//	int a = 13;
//  //把a的二进制中的第5位置换成1
//	a = a | (1 << 4);
//	printf("a = %d\n", a);
//  //把a的二进制中的第5位置换成0
//	a = a & ~(1 << 4);
//	printf("a = %d\n", a);
//	//00000000000000000000000000001101
//	//00000000000000000000000000010000
//	return 0;
//}
//编写代码实现：求一个整数存储在内存中的二进制中1的个数。
//int main()
//{
//	int a = -13;
//	int count = 0;
//	if (a<0)
//	{
//		a = -a;
//		count=count + 1;
//		while (a > 0)
//		{
//			int ret = a & 1;
//			a = a >> 1;
//			if (ret == 1)
//			{
//				count++;
//			}
//		}
//		
//	}
//	if (a>=0)
//	{
//		while (a > 0)
//		{
//			int ret = a & 1;
//			a = a >> 1;
//			if (ret == 1)
//			{
//				count++;
//			}
//		}
//	}
//	printf("count = %d\n", count);
//	return 0;
//}

//(4) 赋值操作符
//  = ,+= ,-= ,*= ,/= ,%= ,>>= ,<<= ,&= ,|= ,^=
//a = a + 100;等于(==)
//a += 100;

//(5) 单目操作符
//  !                  逻辑反操作
//  -                     负值
//  +                     正值
//  &                    取地址
//  sizeof         操作数的类型长度（以字节为单位）
//  ~              对一个数的二进制按位取反
//  --                  前置、后置--
//  ++                  前置、后置++
//  *              间接访问操作符(解引用操作符) 
//  (类型)              强制类型转换
//int main()
//{
//	int a = -10;
//	int* p = NULL;
//	printf("%d\n", !2);
//	printf("%d\n", !0);
//	a = -a;
//	p = &a;
//	char arr[15] = { 0 };
//	printf("%d\n", sizeof(arr));
//	printf("%d\n", sizeof(a));
//	printf("%d\n", sizeof(int));
//	printf("%d\n", sizeof a);//行
//	//printf("%d\n", sizeof int);//不行
//	//证明sizeof是操作符，不是函数
//	return 0;
//}
//int main()
//{
//	int a = 10;
//	//int b = a++;//后置++,先使用，再++
//	int b = ++a;//前置++,先++,后使用
//	printf("%d\n", a);
//	printf("%d\n", b);
//	return 0;
//}
//int main()
//{
//	int a = 10;
//	printf("%p\n", &a);
//	int* pa = &a;//pa - 存放地址  * 告诉pa为指针变量
//	*pa = 20;//* - 解引用操作符(间接访问操作符)
//	printf("%d\n", a);
//	return 0;
//}

//(6) 关系操作符
//  > ,>= ,< ,<= ,!= ,==
//警告：在编程的过程中小心写错 == 和 = ，导致的错误
//比较两个字符不能用==

//(7) 逻辑操作符
// && - 逻辑与(并且)
// || - 逻辑或(或者)
//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	i = a++ && ++b && d++;
//	//i = a++||++b||d++;
//	printf("a = %d\nb = %d\nc = %d\nd = %d\n", a, b, c, d);
//	return 0;
//}
//程序输出的结果是什么？
//int c = a && b; a,b中有一个为0，则结果为0;
//int c = a || b; 前面为真，后面就不用算了

//(8) 条件操作符(三目操作符)
// exp1 ?  exp2 :  exp3
//int main()
//{
//	int a = 5;
//	int b = 0;
//	if (a>5)
//		b = 1;
//	else
//		b = -1;
//	//三目操作符
//	b = a > 5 ? 1 : -1;
//	//表达式1的结果如果为真，表达式2的结果就要赋给b;
//  //否则就把表达式3的结果赋给b;
//	return 0;
//}

//(9) 逗号表达式
//  exp1, exp2, exp3, …expN
//int main()
//{
//	int a = 3;
//	int b = 5;
//	int c = 0;
//	int d = (c = 5, a = c + 3, b = a - 4, c += 5);
//	//逗号表达式 - 
//	//要从左向右依次计算，但是整个表达式的结果是最后一个表达式的结果；
//	printf("%d\n", d);
//	return 0;
//}

//(10) 下标引用、函数调用和结构成员
//1.[] 下标引用操作符
//操作数：一个数组名 + 一个索引值
//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	printf("%d\n",arr[4] );
//	// [] 的操作数是两个:arr,4
//	return 0;
//}
//2.() 函数调用操作符
//接受一个或者多个操作数：
//第一个操作数是函数名，剩余的操作数就是传递给函数的参数。
//3.访问一个结构的成员
// . 结构体.成员名
// -> 结构体指针->成员名
//创建了一个自定义的类型
struct Book
{
	//结构体的成员(变量)
	char name[20];
	char id[20];
	int price;
};
int main()
{
	//结构体变量名.成员名
	struct Book b = { "C语言","c20210924",55 };
	struct Book* pb = &b;
	//结构体指针->成员名
	printf("书名:%s\n", pb->name);
	printf("书号:%s\n", pb->id);
	printf("定价:%d\n", pb->price);

	printf("书名:%s\n", (*pb).name);
	printf("书号:%s\n", (*pb).id);
	printf("定价:%d\n", (*pb).price);

	printf("书名:%s\n", b.name);
	printf("书号:%s\n", b.id);
	printf("定价:%d\n", b.price);
	return 0;
}